cases/case6/constant/polyMesh/blockMeshDict
/*------------------------------*- C++ -*--------------------------------*\ 
| =========                 |                                             | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox       | 
|  \\    /   O peration     | Version:  2.4.0                             | 
|   \\  /    A nd           | Web:      www.openfoam.com                  | 
|    \\/     M anipulation  |                                             | 
\*-----------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.0; 

vertices
(
    (  -25000     -0.5        0)
    (   25000     -0.5        0)
    (   25000      0.5        0)
    (  -25000      0.5        0)
    (  -25000     -0.5     100000)
    (   25000     -0.5     100000)
    (   25000      0.5     100000)
    (  -25000      0.5     100000)
);

edges
(
);

blocks
(
    hex (0  1  2  3  4  5  6  7) (512 8 1024)
    simpleGrading (
      1
      1
      1
    )
);

boundary
(
    outlet
    {
      type patch;
      faces
      (
        (4  5  6  7)
      );
    }

    inlet
    {
      type patch;
      faces
      (
        (0   1   2   3)
      );
    }

    walls
    {
      type wall;
      faces
      (
        ( 0   1   5   4)
        ( 2   3   7   6)
      );
    }

    periodicx1
    {
      type cyclic;
      neighbourPatch periodicx2;
      faces
      (
        ( 0   4   7   3)
      );
    }

    periodicx2
    {
      type cyclic;
      neighbourPatch periodicx1;
      faces
      (
        ( 1   2   6   5)
      );
    }

);

mergePatchPairs
(
);

// ********************************************************************* //
